{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "input_dtype": "float32", "border_mode": "same", "batch_input_shape": [null, 60, 80, 3], "W_regularizer": null, "activation": "relu", "nb_row": 5}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 76800, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 10}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}]}